In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
from pandas import Series, DataFrame

In [4]:
#移除重复数据

In [6]:
data = DataFrame({'k1':['one']*3 + ['two']*4, 'k2':[1,1,2,3,3,4,4]})

In [7]:
data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [8]:
#检查是否重复

In [9]:
data.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [10]:
#移除重复

In [12]:
data.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [13]:
data.drop_duplicates('k1')

    k1  k2
0  one   1
3  two   3

In [14]:
#使用map映射，进行数据转换

In [15]:
data = DataFrame({'food':['bacon', 'pulled pork', 'Pastrami'], 'ounces':[4,3,2]})

In [16]:
data

          food  ounces
0        bacon       4
1  pulled pork       3
2     Pastrami       2

In [18]:
meat_to_animal = {'bacon':'pig', 'pulled pork':'pig', 'pastrami':'cow'}

In [19]:
data['animal'] = data['food'].map(str.lower).map(meat_to_animal)

In [20]:
data

          food  ounces animal
0        bacon       4    pig
1  pulled pork       3    pig
2     Pastrami       2    cow

In [21]:
#or

In [23]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0    pig
1    pig
2    cow
Name: food, dtype: object

In [24]:
#使用replace快速替换特殊值

In [25]:
data = Series([1,-999,2,3,0])

In [26]:
data

0      1
1   -999
2      2
3      3
4      0
dtype: int64

In [27]:
data.replace([-999,0], np.nan)

0    1.0
1    NaN
2    2.0
3    3.0
4    NaN
dtype: float64

In [28]:
data.replace([-999,0], [np.nan,0])

0    1.0
1    NaN
2    2.0
3    3.0
4    0.0
dtype: float64

In [29]:
#离散化和面元

In [30]:
ages = [20,22,25,27,21,23,37,31,61,45,41,32]

In [31]:
bins = [18,25,35,60,100]

In [32]:
cats = pd.cut(ages,bins)

In [33]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [36]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [38]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [40]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [41]:
#等长面元

In [42]:
data = np.random.rand(20)

In [43]:
pd.cut(data, 4, precision=2)

[(-0.00061, 0.25], (-0.00061, 0.25], (-0.00061, 0.25], (0.49, 0.74], (0.25, 0.49], ..., (-0.00061, 0.25], (0.49, 0.74], (0.25, 0.49], (0.49, 0.74], (-0.00061, 0.25]]
Length: 20
Categories (4, interval[float64]): [(-0.00061, 0.25] < (0.25, 0.49] < (0.49, 0.74] < (0.74, 0.98]]

In [44]:
#根据分位数

In [45]:
data = np.random.randn(1000) #rand后有n表示正态分布，正态分布的数据按分位数切割，得到每组数量相等

In [46]:
cats = pd.qcut(data, 4)

In [47]:
cats

[(-0.0308, 0.695], (-0.0308, 0.695], (-0.711, -0.0308], (-0.711, -0.0308], (-0.0308, 0.695], ..., (-0.711, -0.0308], (-0.711, -0.0308], (-3.581, -0.711], (0.695, 3.368], (0.695, 3.368]]
Length: 1000
Categories (4, interval[float64]): [(-3.581, -0.711] < (-0.711, -0.0308] < (-0.0308, 0.695] < (0.695, 3.368]]

In [48]:
pd.value_counts(cats)

(0.695, 3.368]       250
(-0.0308, 0.695]     250
(-0.711, -0.0308]    250
(-3.581, -0.711]     250
dtype: int64

In [49]:
#自定义分位数

In [50]:
pd.qcut(data, [0,0.1,0.5,0.9,1])

[(-0.0308, 1.251], (-0.0308, 1.251], (-1.276, -0.0308], (-1.276, -0.0308], (-0.0308, 1.251], ..., (-1.276, -0.0308], (-1.276, -0.0308], (-3.581, -1.276], (-0.0308, 1.251], (-0.0308, 1.251]]
Length: 1000
Categories (4, interval[float64]): [(-3.581, -1.276] < (-1.276, -0.0308] < (-0.0308, 1.251] < (1.251, 3.368]]